app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "klofromtheblock123"]]
---
  def authenticate
    @username = params[:username]
    @password = params[:password]
    user = User.find_by(username: @username)