app/controllers/events_controller.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "events".* FROM "events" WHERE "events"."trip_id" = $1  ORDER BY date DESC  [["trip_id", 4]]
---
  def index
    # user = @current_user
    # trips = Trip.where(user_id: user.id)

    trip = Trip.find(params[:trip_id])
    events = trip.events.all

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events" WHERE "events"."trip_id" = $1  ORDER BY date DESC  [["trip_id", 1]]
---
  def all_trip_events
    trip = Trip.find(params[:trip_id])
    events = trip.events.all

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "events" ("trip_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["trip_id", 4], ["created_at", "2015-02-18 05:42:32.465127"], ["updated_at", "2015-02-18 05:42:32.465127"]]
---
  def create
    trip = Trip.find(params[:trip_id])
    # event = trip.events.create(events_params)
    # event = trip.events.create(title: params[:title], content: params[:content], date: params[:date])
    event = trip.events.create()

SELECT  "events".* FROM "events" WHERE "events"."id" = $1  ORDER BY date DESC LIMIT 1  [["id", 26]]
UPDATE "events" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["title", "Hideout"], ["content", "The best place to see everything and hideout at the same time!"], ["updated_at", "2015-02-19 08:58:00.152353"], ["id", 30]]
---
  def update
    event = Event.find(params[:id])
    event.update(title: params[:title], content: params[:content], date: params[:date])

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "events".* FROM "events" WHERE "events"."trip_id" = $1 AND "events"."id" = $2  ORDER BY date DESC LIMIT 1  [["trip_id", 2], ["id", 9]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 9]]
---
  def destroy
    trip = Trip.find(params[:trip_id])
    event = trip.events.find_by(id: params[:id])
    event.destroy

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 19]]
SELECT "events".* FROM "events" INNER JOIN "event_tags" ON "events"."id" = "event_tags"."event_id" WHERE "event_tags"."tag_id" = $1 AND "events"."trip_id" = $2  ORDER BY date DESC  [["tag_id", 19], ["trip_id", 1]]
SELECT "events".* FROM "events" INNER JOIN "event_tags" ON "events"."id" = "event_tags"."event_id" WHERE "event_tags"."tag_id" = $1  ORDER BY date DESC  [["tag_id", 19]]
SELECT  "places".* FROM "places" WHERE "places"."event_id" = $1 LIMIT 1  [["event_id", 3]]
SELECT "photos".* FROM "photos" WHERE "photos"."event_id" = $1  [["event_id", 3]]
---
  def tag
    # returns events with a specific tag name
    p '###' * 25 + 'Get Events By Tag'
    p params
    # tag_name = params[:name].downcase
    tag = Tag.find(params[:tag_id])
    tag_name = tag.name
    events_by_tag = tag.events.where(trip_id: params[:trip_id])
    all_places = []
    places = tag.events.each do |event|
      all_places << event.place
    end

    all_photos = []
    places = events_by_tag.each do |event|
      event.photos.each do |photo|

SELECT  "events".* FROM "events" WHERE "events"."id" = $1  ORDER BY date DESC LIMIT 1  [["id", 23]]
SELECT "event_tags".* FROM "event_tags" WHERE "event_tags"."event_id" = $1  [["event_id", 23]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 21]]
---
  def tags_for_one_event
    event = Event.find(params[:event_id])
    joins = EventTag.where(event_id: event.id) #returns array
    tag_ids = joins.map { |entry| entry.tag_id}

SELECT  "events".* FROM "events" WHERE "events"."id" = $1  ORDER BY date DESC LIMIT 1  [["id", 0]]
---
  def show
    # trip = Trip.find(params[:trip_id])
    event = Event.find(params[:id])