app/controllers/facebook_controller.rb

  def save_token
    response = HTTParty.get("https://graph.facebook.com/oauth/access_token?grant_type=fb_exchange_token&client_id=#{ENV['FACEBOOK_KEY']}&client_secret=#{ENV['FACEBOOK_SECRET']}&fb_exchange_token=#{params[:accessToken]}")
    parsed_response = response.parsed_response
    long_live_token = parsed_response[13..parsed_response.length-17]

    @current_user.update(fb_uid: params[:user_id], fb_token: long_live_token)
---
UPDATE "users" SET "fb_uid" = $1, "fb_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4