app/controllers/instagram_controller.rb

  def oauth_token
    p "#" * 20
    p params['access_token']
    p "#" * 20
    p @current_user
    p "#" * 20
    response = HTTParty.post("https://api.instagram.com/oauth/access_token", :body => { client_id: ENV['INSTAGRAM_CLIENT_ID'], client_secret: ENV['INSTAGRAM_CLIENT_SECRET'], grant_type: "authorization_code", code: params['access_token'], redirect_uri: "http://traverse-app.herokuapp.com/#/instagram.html" })

     p "RESPONSE======================"
    p response
    p "#" * 20
    if response.parsed_response['code'] == 400
      render json: false
    else
      @current_user.update(ig_token: response['access_token'], ig_uid: response['user']['id'])
---
UPDATE "users" SET "ig_token" = $1, "ig_uid" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["ig_token", "1708549317.cb89d1d.61a33a5d010245edbd1fd947360722e0"], ["ig_uid", "1708549317"], ["updated_at", "2015-02-18 06:32:07.285818"], ["id", 4]]