app/controllers/photos_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1  ORDER BY date DESC LIMIT 1  [["id", 0]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "photos" ("url", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
UPDATE "trips" SET "photo" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["photo", "http://scontent-a.cdninstagram.com/hphotos-xap1/t51.2885-15/e15/10735557_1495850307349697_884628234_n.jpg"], ["updated_at", "2015-02-19 07:17:40.503277"], ["id", 4]]
---
  def create
    # p "%" *20
    # p params
    # p "%" *20
    event = Event.find(params[:event_id])
    trip = Trip.find(event.trip_id)
    photos = params[:photos]

    p params[:photos]

    photos.each do |photo|
      @last_photo = event.photos.create(url: photo)
    end

    # p "%" *20
    # p @last_photo
    # p event.id
    # p trip.id
    # p "%" *20
    trip.update(photo: @last_photo.url)

SELECT "photos".* FROM "photos" WHERE "photos"."event_id" = $1  [["event_id", 24]]
---
  def photos_for_one_event
    photos = Photo.where(event_id: params[:event_id])