app/controllers/tags_controller.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "event_tags".* FROM "event_tags" WHERE "event_tags"."trip_id" = $1  [["trip_id", 4]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 19]]
---
 def index
  # returns all tags for one trip
  trip = Trip.find(params[:trip_id])
  events_tags = EventTag.where(trip_id: trip.id)
  tag_ids = events_tags.map{|event| event.tag_id}

SELECT  "events".* FROM "events" WHERE "events"."id" = $1  ORDER BY date DESC LIMIT 1  [["id", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT 1  [["name", "beach"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "beach"], ["created_at", "2015-02-19 03:17:33.324993"], ["updated_at", "2015-02-19 03:17:33.324993"]]
INSERT INTO "event_tags" ("event_id", "tag_id", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 1], ["tag_id", 19], ["trip_id", 1], ["created_at", "2015-02-19 03:17:33.332364"], ["updated_at", "2015-02-19 03:17:33.332364"]]
---
  def create
    # p params
    event = Event.find(params[:event_id])
    trip_id = event.trip_id
    tag_name = params[:name]
    tag_name.downcase
    input_tag = Tag.find_by(name: tag_name)

    tag = Tag.new(name: tag_name)

    if tag.save
      EventTag.create(event_id: event.id, tag_id: tag.id, trip_id: trip_id)

SELECT "tags".* FROM "tags" WHERE "tags"."default_photo" = 't'
---
  def default_tags
    tags_object = Tag.where(default_photo: true)