app/controllers/trips_controller.rb

  def index
    user = @current_user
    trips = Trip.where(user_id: user.id)
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 4]]

  def create
    user = @current_user
    trip = user.trips.create(title: params[:title])
---
INSERT INTO "trips" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "paris"], ["user_id", 4], ["created_at", "2015-02-18 05:41:52.652898"], ["updated_at", "2015-02-18 05:41:52.652898"]]

  def map
    user = @current_user
    trip = Trip.find(params[:trip_id])
    trip_events = trip.events
    places = []
    trip_events.each do |event|
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "events".* FROM "events" WHERE "events"."trip_id" = $1  ORDER BY date DESC  [["trip_id", 4]]